#include <iostream>
#include <string>
using namespace std;

int main() {
	double km;
	cin >> km;
	string dn;
	cin >> dn;
	// Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв./км. Нощна тарифа: 0.90 лв./км.
	//Автобус.Дневна / нощна тарифа : 0.09 лв. / км.Може да се използва за разстояния минимум 20 км.
		//Влак.Дневна / нощна тарифа : 0.06 лв. / км.Може да се използва за разстояния минимум 100 км.
	if (km >= 100) {
		cout << km * 0.06 << "\n";
	}
	else if (km >= 20) {
		cout << km * 0.09 << "\n";
	}
	else {
		if (dn == "day") {
			cout << (km * 0.79) + 0.7 << "\n";
		}
		if (dn == "night") {
			cout << (km * 0.9) + 0.7 << "\n";
		}
	}



	return 0;
}